garyPenhook/PyAvrOCD/svd/at90pwm3.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>EXINT</name>
      <description>External Interrupts</description>
      <baseAddress>0x0080003C</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2D</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>EICRA</name>
          <description>External Interrupt Control Register A</description>
          <addressOffset>0x2D</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ISC0</name>
              <description>External Interrupt Sense Control Bit</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW_LEVEL_OF_INTX</name>
                  <description>Low Level of INTX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANY_LOGICAL_CHANGE_OF_INTX</name>
                  <description>Any Logical Change of INTX</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING_EDGE_OF_INTX</name>
                  <description>Falling Edge of INTX</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING_EDGE_OF_INTX</name>
                  <description>Rising Edge of INTX</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISC1</name>
              <description>External Interrupt Sense Control Bit</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW_LEVEL_OF_INTX</name>
                  <description>Low Level of INTX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANY_LOGICAL_CHANGE_OF_INTX</name>
                  <description>Any Logical Change of INTX</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING_EDGE_OF_INTX</name>
                  <description>Falling Edge of INTX</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING_EDGE_OF_INTX</name>
                  <description>Rising Edge of INTX</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISC2</name>
              <description>External Interrupt Sense Control Bit</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW_LEVEL_OF_INTX</name>
                  <description>Low Level of INTX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANY_LOGICAL_CHANGE_OF_INTX</name>
                  <description>Any Logical Change of INTX</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING_EDGE_OF_INTX</name>
                  <description>Falling Edge of INTX</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING_EDGE_OF_INTX</name>
                  <description>Rising Edge of INTX</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISC3</name>
              <description>External Interrupt Sense Control Bit</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW_LEVEL_OF_INTX</name>
                  <description>Low Level of INTX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANY_LOGICAL_CHANGE_OF_INTX</name>
                  <description>Any Logical Change of INTX</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING_EDGE_OF_INTX</name>
                  <description>Falling Edge of INTX</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING_EDGE_OF_INTX</name>
                  <description>Rising Edge of INTX</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EIFR</name>
          <description>External Interrupt Flag Register (read-only for debugger)</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INTF</name>
              <description>External Interrupt Flags</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>EIMSK</name>
          <description>External Interrupt Mask Register</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INT</name>
              <description>External Interrupt Request Enable</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
