garyPenhook/PyAvrOCD/svd/at90pwm3.svd
        <register>
          <name>PSOC1</name>
          <description>PSC1 Synchro and Output Configuration</description>
          <addressOffset>0x3E</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>POEN1A</name>
              <description>PSCOUT10 Output Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>POEN1B</name>
              <description>PSCOUT11 Output Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PSYNC1_</name>
              <description>Synchronization Out for ADC Selection</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEND_SIGNAL_ON_LEADING_EDGE_OF_PSCOUTN0</name>
                  <description>Send signal on leading edge of PSCOUTn0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEND_SIGNAL_ON_TRAILING_EDGE_OF_PSCOUTN0</name>
                  <description>Send signal on trailing edge of PSCOUTn0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEND_SIGNAL_ON_LEADING_EDGE_OF_PSCOUTN1</name>
                  <description>Send signal on leading edge of PSCOUTn1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEND_SIGNAL_ON_TRAILING_EDGE_OF_PSCOUTN1</name>
                  <description>Send signal on trailing edge of PSCOUTn1</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PSC2</name>
      <description>Power Stage Controller</description>
      <baseAddress>0x008000A4</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4C</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>OCR2RA</name>
          <description>Output Compare 2 RA Register</description>
          <addressOffset>0x50</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OCR2RA</name>
              <description>Output Compare RA</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>OCR2RB</name>
          <description>Output Compare 2 RB Register</description>
          <addressOffset>0x54</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OCR2RB</name>
              <description>Output Compare RB</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>OCR2SA</name>
          <description>Output Compare 2 SA Register</description>
          <addressOffset>0x4E</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OCR2SA</name>
              <description>Output Compare SA</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>OCR2SB</name>
          <description>Output Compare 2 SB Register</description>
          <addressOffset>0x52</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OCR2SB</name>
              <description>Output Compare SB</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PCNF2</name>
          <description>PSC 2 Configuration Register</description>
          <addressOffset>0x56</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>POME2</name>
              <description>PSC 2 Output Matrix Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PCLKSEL2</name>
              <description>PSC 2 Input Clock Select</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>POP2</name>
              <description>PSC 2 Output Polarity</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PMODE2</name>
              <description>PSC 2 Mode</description>
              <bitRange>[4:3]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ONE_RAMP_MODE</name>
                  <description>One Ramp Mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWO_RAMP_MODE</name>
                  <description>Two Ramp Mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOUR_RAMP_MODE</name>
                  <description>Four Ramp Mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CENTER_ALIGNED_MODE</name>
                  <description>Center Aligned Mode</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLOCK2</name>
              <description>PSC 2 Lock</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PALOCK2</name>
              <description>PSC 2 Autolock</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PFIFTY2</name>
              <description>PSC 2 Fifty</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PCTL2</name>
          <description>PSC 2 Control Register</description>
          <addressOffset>0x57</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PRUN2</name>
              <description>PSC 2 Run</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PCCYC2</name>
              <description>PSC2 Complete Cycle</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PARUN2</name>
              <description>PSC2 Auto Run</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PAOC2A</name>
              <description>PSC 2 Asynchronous Output Control A</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PAOC2B</name>
              <description>PSC 2 Asynchronous Output Control B</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PBFM2</name>
              <description>Balance Flank Width Modulation</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PPRE2</name>
              <description>PSC 2 Prescaler Selects</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_DIVIDER_ON_PSC_INPUT_CLOCK</name>
                  <description>No divider on PSC input clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_THE_PSC_INPUT_CLOCK_BY_4</name>
                  <description>Divide the PSC input clock by 4</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_THE_PSC_INPUT_CLOCK_BY_16</name>
                  <description>Divide the PSC input clock by 16</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_THE_PSC_INPUT_CLOCK_BY_64</name>
                  <description>Divide the PSC input clock by 64</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PFRC2A</name>
          <description>PSC 2 Input B Control</description>
          <addressOffset>0x58</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PRFM2A</name>
              <description>PSC 2 Retrigger and Fault Mode for Part A</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_ACTION_PSC_INPUT_IS_IGNORED</name>
                  <description>No action, PSC Input is ignored</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP_SIGNAL_EXECUTE_OPPOSITE_DEAD_TIME_AND_WAIT</name>
                  <description>Stop signal, Execute Opposite Dead-Time and Wait</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP_SIGNAL_EXECUTE_OPPOSITE_WHILE_FAULT_ACTIVE</name>
                  <description>Stop signal, Execute Opposite while Fault active</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEACTIVATE_OUTPUTS_WITHOUT_CHANGING_TIMING</name>
                  <description>Deactivate outputs without changing timing.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP_SIGNAL_AND_INSERT_DEAD_TIME</name>
                  <description>Stop signal and Insert Dead-Time</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP_SIGNAL_JUMP_TO_OPPOSITE_DEAD_TIME_AND_WAIT</name>
                  <description>Stop signal, Jump to Opposite Dead-Time and Wait.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HALT_PSC_AND_WAIT_FOR_SOFTWARE_ACTION</name>
                  <description>Halt PSC and Wait for Software Action</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDGE_RETRIGGER_PSC</name>
                  <description>Edge Retrigger PSC</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIXED_FREQUENCY_EDGE_RETRIGGER_PSC</name>
                  <description>Fixed Frequency Edge Retrigger PSC</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIXED_FREQUENCY_EDGE_RETRIGGER_PSC_AND_DISACTIVATE_OUTPUT</name>
                  <description>Fixed Frequency Edge Retrigger PSC and Deactivate Output</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED_DO_NOT_USE</name>
                  <description>Reserved (do not use)</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PFLTE2A</name>
              <description>PSC 2 Filter Enable on Input Part A</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PELEV2A</name>
              <description>PSC 2 Edge Level Selector on Input Part A</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PISEL2A</name>
              <description>PSC 2 Input Select for Part A</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PCAE2A</name>
              <description>PSC 2 Capture Enable Input Part A</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PFRC2B</name>
          <description>PSC 2 Input B Control</description>
          <addressOffset>0x59</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PRFM2B</name>
              <description>PSC 2 Retrigger and Fault Mode for Part B</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_ACTION_PSC_INPUT_IS_IGNORED</name>
                  <description>No action, PSC Input is ignored</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP_SIGNAL_EXECUTE_OPPOSITE_DEAD_TIME_AND_WAIT</name>
                  <description>Stop signal, Execute Opposite Dead-Time and Wait</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP_SIGNAL_EXECUTE_OPPOSITE_WHILE_FAULT_ACTIVE</name>
                  <description>Stop signal, Execute Opposite while Fault active</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEACTIVATE_OUTPUTS_WITHOUT_CHANGING_TIMING</name>
                  <description>Deactivate outputs without changing timing.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP_SIGNAL_AND_INSERT_DEAD_TIME</name>
                  <description>Stop signal and Insert Dead-Time</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP_SIGNAL_JUMP_TO_OPPOSITE_DEAD_TIME_AND_WAIT</name>
                  <description>Stop signal, Jump to Opposite Dead-Time and Wait.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HALT_PSC_AND_WAIT_FOR_SOFTWARE_ACTION</name>
                  <description>Halt PSC and Wait for Software Action</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDGE_RETRIGGER_PSC</name>
                  <description>Edge Retrigger PSC</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIXED_FREQUENCY_EDGE_RETRIGGER_PSC</name>
                  <description>Fixed Frequency Edge Retrigger PSC</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIXED_FREQUENCY_EDGE_RETRIGGER_PSC_AND_DISACTIVATE_OUTPUT</name>
                  <description>Fixed Frequency Edge Retrigger PSC and Deactivate Output</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED_DO_NOT_USE</name>
                  <description>Reserved (do not use)</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PFLTE2B</name>
              <description>PSC 2 Filter Enable on Input Part B</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PELEV2B</name>
              <description>PSC 2 Edge Level Selector on Input Part B</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PISEL2B</name>
              <description>PSC 2 Input Select for Part B</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PCAE2B</name>
              <description>PSC 2 Capture Enable Input Part B</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PICR2</name>
          <description>PSC 2 Input Capture Register </description>
          <addressOffset>0x5A</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PICR2</name>
              <description>PSC 2 Input Capture Bytes</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PIFR2</name>
          <description>PSC2 Interrupt Flag Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PEOP2</name>
              <description>End of PSC2 Interrupt</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRN2</name>
              <description>Ramp Number</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1</name>
                  <description>1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>3</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>4</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PEV2A</name>
              <description>External Event A Interrupt</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PEV2B</name>
              <description>External Event B Interrupt</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PSEI2</name>
              <description>PSC 2 Synchro Error Interrupt</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
